<?xml version="1.0" encoding="UTF-8"?>
<WebElementEntity>
   <description></description>
   <name>form_19131914191519161917191819191920192119_0c2cba</name>
   <tag></tag>
   <elementGuidId>c3637d34-ebb9-4a8f-8bd5-173aef5edb07</elementGuidId>
   <selectorCollection>
      <entry>
         <key>CSS</key>
         <value>form.ng-dirty.ng-valid-parse.ng-invalid.ng-invalid-maxlength</value>
      </entry>
      <entry>
         <key>BASIC</key>
         <value>id(&quot;signup&quot;)/div[@class=&quot;container&quot;]/div[@class=&quot;row&quot;]/div[@class=&quot;col-md-offset-1 col-md-10&quot;]/div[@class=&quot;bg-transparent&quot;]/form[@class=&quot;ng-dirty ng-valid-parse ng-invalid ng-invalid-maxlength&quot;][count(. | //form[@class = 'ng-dirty ng-valid-parse ng-invalid ng-invalid-maxlength' and (text() = '




































19131914191519161917191819191920192119221923192419251926192719281929193019311932193319341935193619371938193919401941194219431944194519461947194819491950195119521953195419551956195719581959196019611962196319641965196619671968196919701971197219731974197519761977197819791980198119821983198419851986198719881989199019911992199319941995199619971998199920002001200220032004200520062007200820092010201120122013มกราคมกุมภาพันธ์มีนาคมเมษายนพฤษภาคมมิถุนายนกรกฎาคมสิงหาคมกันยายนตุลาคมพฤศจิกายนธันวาคม  อ.จ.อ.พ.พฤ.ศ.ส.2324252627281234567891011121314151617181920212223242526272829303112345Close

















ชาย








หญิง








ไม่ระบุ























 















ฉันได้อ่านและยอมรับ ข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัวของเดอะ พิซซ่า คอมปะนี















ฉันยินยอมรับข้อมูลข่าวสาร กิจกรรมส่งเสริมการขายต่างๆ จากเดอะ พิซซ่า คอมปะนีและบริษัทในเครือ โดยเราจะเก็บข้อมูลของท่านไว้เป็นความลับ สามารถศึกษาเงื่อนไข/ข้อตกลง นโยบายความเป็นส่วนตัวเพิ่มเติมได้ที่เว็บไซต์ของบริษัทฯ







สมัครสมาชิก
 กรุณารอสักครู่...


' or . = '




































19131914191519161917191819191920192119221923192419251926192719281929193019311932193319341935193619371938193919401941194219431944194519461947194819491950195119521953195419551956195719581959196019611962196319641965196619671968196919701971197219731974197519761977197819791980198119821983198419851986198719881989199019911992199319941995199619971998199920002001200220032004200520062007200820092010201120122013มกราคมกุมภาพันธ์มีนาคมเมษายนพฤษภาคมมิถุนายนกรกฎาคมสิงหาคมกันยายนตุลาคมพฤศจิกายนธันวาคม  อ.จ.อ.พ.พฤ.ศ.ส.2324252627281234567891011121314151617181920212223242526272829303112345Close

















ชาย








หญิง








ไม่ระบุ























 















ฉันได้อ่านและยอมรับ ข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัวของเดอะ พิซซ่า คอมปะนี















ฉันยินยอมรับข้อมูลข่าวสาร กิจกรรมส่งเสริมการขายต่างๆ จากเดอะ พิซซ่า คอมปะนีและบริษัทในเครือ โดยเราจะเก็บข้อมูลของท่านไว้เป็นความลับ สามารถศึกษาเงื่อนไข/ข้อตกลง นโยบายความเป็นส่วนตัวเพิ่มเติมได้ที่เว็บไซต์ของบริษัทฯ







สมัครสมาชิก
 กรุณารอสักครู่...


')]) = count(//form[@class = 'ng-dirty ng-valid-parse ng-invalid ng-invalid-maxlength' and (text() = '




































19131914191519161917191819191920192119221923192419251926192719281929193019311932193319341935193619371938193919401941194219431944194519461947194819491950195119521953195419551956195719581959196019611962196319641965196619671968196919701971197219731974197519761977197819791980198119821983198419851986198719881989199019911992199319941995199619971998199920002001200220032004200520062007200820092010201120122013มกราคมกุมภาพันธ์มีนาคมเมษายนพฤษภาคมมิถุนายนกรกฎาคมสิงหาคมกันยายนตุลาคมพฤศจิกายนธันวาคม  อ.จ.อ.พ.พฤ.ศ.ส.2324252627281234567891011121314151617181920212223242526272829303112345Close

















ชาย








หญิง








ไม่ระบุ























 















ฉันได้อ่านและยอมรับ ข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัวของเดอะ พิซซ่า คอมปะนี















ฉันยินยอมรับข้อมูลข่าวสาร กิจกรรมส่งเสริมการขายต่างๆ จากเดอะ พิซซ่า คอมปะนีและบริษัทในเครือ โดยเราจะเก็บข้อมูลของท่านไว้เป็นความลับ สามารถศึกษาเงื่อนไข/ข้อตกลง นโยบายความเป็นส่วนตัวเพิ่มเติมได้ที่เว็บไซต์ของบริษัทฯ







สมัครสมาชิก
 กรุณารอสักครู่...


' or . = '




































19131914191519161917191819191920192119221923192419251926192719281929193019311932193319341935193619371938193919401941194219431944194519461947194819491950195119521953195419551956195719581959196019611962196319641965196619671968196919701971197219731974197519761977197819791980198119821983198419851986198719881989199019911992199319941995199619971998199920002001200220032004200520062007200820092010201120122013มกราคมกุมภาพันธ์มีนาคมเมษายนพฤษภาคมมิถุนายนกรกฎาคมสิงหาคมกันยายนตุลาคมพฤศจิกายนธันวาคม  อ.จ.อ.พ.พฤ.ศ.ส.2324252627281234567891011121314151617181920212223242526272829303112345Close

















ชาย








หญิง








ไม่ระบุ























 















ฉันได้อ่านและยอมรับ ข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัวของเดอะ พิซซ่า คอมปะนี















ฉันยินยอมรับข้อมูลข่าวสาร กิจกรรมส่งเสริมการขายต่างๆ จากเดอะ พิซซ่า คอมปะนีและบริษัทในเครือ โดยเราจะเก็บข้อมูลของท่านไว้เป็นความลับ สามารถศึกษาเงื่อนไข/ข้อตกลง นโยบายความเป็นส่วนตัวเพิ่มเติมได้ที่เว็บไซต์ของบริษัทฯ







สมัครสมาชิก
 กรุณารอสักครู่...


')])]</value>
      </entry>
      <entry>
         <key>XPATH</key>
         <value>//section[@id='signup']/div/div/div/div[2]/form</value>
      </entry>
   </selectorCollection>
   <selectorMethod>BASIC</selectorMethod>
   <useRalativeImagePath>true</useRalativeImagePath>
   <webElementProperties>
      <isSelected>true</isSelected>
      <matchCondition>equals</matchCondition>
      <name>tag</name>
      <type>Main</type>
      <value>form</value>
      <webElementGuid>8cd3ec57-8bff-4cf9-b86f-4d9ee4cfd1ee</webElementGuid>
   </webElementProperties>
   <webElementProperties>
      <isSelected>true</isSelected>
      <matchCondition>equals</matchCondition>
      <name>class</name>
      <type>Main</type>
      <value>ng-dirty ng-valid-parse ng-invalid ng-invalid-maxlength</value>
      <webElementGuid>1bb54d83-9724-4edc-b2d9-ef796f47317a</webElementGuid>
   </webElementProperties>
   <webElementProperties>
      <isSelected>true</isSelected>
      <matchCondition>equals</matchCondition>
      <name>text</name>
      <type>Main</type>
      <value>




































19131914191519161917191819191920192119221923192419251926192719281929193019311932193319341935193619371938193919401941194219431944194519461947194819491950195119521953195419551956195719581959196019611962196319641965196619671968196919701971197219731974197519761977197819791980198119821983198419851986198719881989199019911992199319941995199619971998199920002001200220032004200520062007200820092010201120122013มกราคมกุมภาพันธ์มีนาคมเมษายนพฤษภาคมมิถุนายนกรกฎาคมสิงหาคมกันยายนตุลาคมพฤศจิกายนธันวาคม  อ.จ.อ.พ.พฤ.ศ.ส.2324252627281234567891011121314151617181920212223242526272829303112345Close

















ชาย








หญิง








ไม่ระบุ























 















ฉันได้อ่านและยอมรับ ข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัวของเดอะ พิซซ่า คอมปะนี















ฉันยินยอมรับข้อมูลข่าวสาร กิจกรรมส่งเสริมการขายต่างๆ จากเดอะ พิซซ่า คอมปะนีและบริษัทในเครือ โดยเราจะเก็บข้อมูลของท่านไว้เป็นความลับ สามารถศึกษาเงื่อนไข/ข้อตกลง นโยบายความเป็นส่วนตัวเพิ่มเติมได้ที่เว็บไซต์ของบริษัทฯ







สมัครสมาชิก
 กรุณารอสักครู่...


</value>
      <webElementGuid>31ba9b98-41c2-4c6e-94ef-059c5fcfb324</webElementGuid>
   </webElementProperties>
   <webElementProperties>
      <isSelected>true</isSelected>
      <matchCondition>equals</matchCondition>
      <name>xpath</name>
      <type>Main</type>
      <value>id(&quot;signup&quot;)/div[@class=&quot;container&quot;]/div[@class=&quot;row&quot;]/div[@class=&quot;col-md-offset-1 col-md-10&quot;]/div[@class=&quot;bg-transparent&quot;]/form[@class=&quot;ng-dirty ng-valid-parse ng-invalid ng-invalid-maxlength&quot;]</value>
      <webElementGuid>43863085-5ebb-40d5-9583-e9072596f31b</webElementGuid>
   </webElementProperties>
   <webElementXpaths>
      <isSelected>true</isSelected>
      <matchCondition>equals</matchCondition>
      <name>xpath:idRelative</name>
      <type>Main</type>
      <value>//section[@id='signup']/div/div/div/div[2]/form</value>
      <webElementGuid>653766c3-f8dc-414e-9325-3c5858d0a180</webElementGuid>
   </webElementXpaths>
   <webElementXpaths>
      <isSelected>false</isSelected>
      <matchCondition>equals</matchCondition>
      <name>xpath:neighbor</name>
      <type>Main</type>
      <value>(.//*[normalize-space(text()) and normalize-space(.)='เข้าสู่ระบบ'])[1]/following::form[1]</value>
      <webElementGuid>105a28e8-d337-477d-b0ae-e86317a8674a</webElementGuid>
   </webElementXpaths>
   <webElementXpaths>
      <isSelected>false</isSelected>
      <matchCondition>equals</matchCondition>
      <name>xpath:neighbor</name>
      <type>Main</type>
      <value>(.//*[normalize-space(text()) and normalize-space(.)='มีบัญชีสมาชิกอยู่แล้วใช่หรือไม่'])[1]/following::form[1]</value>
      <webElementGuid>77dc14ef-ac43-4f6c-8b07-50ab434f262c</webElementGuid>
   </webElementXpaths>
   <webElementXpaths>
      <isSelected>false</isSelected>
      <matchCondition>equals</matchCondition>
      <name>xpath:position</name>
      <type>Main</type>
      <value>//form</value>
      <webElementGuid>11758936-d520-4589-b474-c2de8d337fd3</webElementGuid>
   </webElementXpaths>
   <webElementXpaths>
      <isSelected>false</isSelected>
      <matchCondition>equals</matchCondition>
      <name>xpath:customAttributes</name>
      <type>Main</type>
      <value>//form[(text() = '




































19131914191519161917191819191920192119221923192419251926192719281929193019311932193319341935193619371938193919401941194219431944194519461947194819491950195119521953195419551956195719581959196019611962196319641965196619671968196919701971197219731974197519761977197819791980198119821983198419851986198719881989199019911992199319941995199619971998199920002001200220032004200520062007200820092010201120122013มกราคมกุมภาพันธ์มีนาคมเมษายนพฤษภาคมมิถุนายนกรกฎาคมสิงหาคมกันยายนตุลาคมพฤศจิกายนธันวาคม  อ.จ.อ.พ.พฤ.ศ.ส.2324252627281234567891011121314151617181920212223242526272829303112345Close

















ชาย








หญิง








ไม่ระบุ























 















ฉันได้อ่านและยอมรับ ข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัวของเดอะ พิซซ่า คอมปะนี















ฉันยินยอมรับข้อมูลข่าวสาร กิจกรรมส่งเสริมการขายต่างๆ จากเดอะ พิซซ่า คอมปะนีและบริษัทในเครือ โดยเราจะเก็บข้อมูลของท่านไว้เป็นความลับ สามารถศึกษาเงื่อนไข/ข้อตกลง นโยบายความเป็นส่วนตัวเพิ่มเติมได้ที่เว็บไซต์ของบริษัทฯ







สมัครสมาชิก
 กรุณารอสักครู่...


' or . = '




































19131914191519161917191819191920192119221923192419251926192719281929193019311932193319341935193619371938193919401941194219431944194519461947194819491950195119521953195419551956195719581959196019611962196319641965196619671968196919701971197219731974197519761977197819791980198119821983198419851986198719881989199019911992199319941995199619971998199920002001200220032004200520062007200820092010201120122013มกราคมกุมภาพันธ์มีนาคมเมษายนพฤษภาคมมิถุนายนกรกฎาคมสิงหาคมกันยายนตุลาคมพฤศจิกายนธันวาคม  อ.จ.อ.พ.พฤ.ศ.ส.2324252627281234567891011121314151617181920212223242526272829303112345Close

















ชาย








หญิง








ไม่ระบุ























 















ฉันได้อ่านและยอมรับ ข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัวของเดอะ พิซซ่า คอมปะนี















ฉันยินยอมรับข้อมูลข่าวสาร กิจกรรมส่งเสริมการขายต่างๆ จากเดอะ พิซซ่า คอมปะนีและบริษัทในเครือ โดยเราจะเก็บข้อมูลของท่านไว้เป็นความลับ สามารถศึกษาเงื่อนไข/ข้อตกลง นโยบายความเป็นส่วนตัวเพิ่มเติมได้ที่เว็บไซต์ของบริษัทฯ







สมัครสมาชิก
 กรุณารอสักครู่...


')]</value>
      <webElementGuid>b20112f5-be52-4c46-8adc-abd575719506</webElementGuid>
   </webElementXpaths>
   <webElementXpaths>
      <isSelected>false</isSelected>
      <matchCondition>equals</matchCondition>
      <name>xpath:customAttributes</name>
      <type>Main</type>
      <value>//form[(text() = '




































19131914191519161917191819191920192119221923192419251926192719281929193019311932193319341935193619371938193919401941194219431944194519461947194819491950195119521953195419551956195719581959196019611962196319641965196619671968196919701971197219731974197519761977197819791980198119821983198419851986198719881989199019911992199319941995199619971998199920002001200220032004200520062007200820092010201120122013มกราคมกุมภาพันธ์มีนาคมเมษายนพฤษภาคมมิถุนายนกรกฎาคมสิงหาคมกันยายนตุลาคมพฤศจิกายนธันวาคม  อ.จ.อ.พ.พฤ.ศ.ส.311234567891011121314151617181920212223242526272829301234567891011Close

















ชาย








หญิง








ไม่ระบุ























 















ฉันได้อ่านและยอมรับ ข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัวของเดอะ พิซซ่า คอมปะนี















ฉันยินยอมรับข้อมูลข่าวสาร กิจกรรมส่งเสริมการขายต่างๆ จากเดอะ พิซซ่า คอมปะนีและบริษัทในเครือ โดยเราจะเก็บข้อมูลของท่านไว้เป็นความลับ สามารถศึกษาเงื่อนไข/ข้อตกลง นโยบายความเป็นส่วนตัวเพิ่มเติมได้ที่เว็บไซต์ของบริษัทฯ







สมัครสมาชิก
 กรุณารอสักครู่...


' or . = '




































19131914191519161917191819191920192119221923192419251926192719281929193019311932193319341935193619371938193919401941194219431944194519461947194819491950195119521953195419551956195719581959196019611962196319641965196619671968196919701971197219731974197519761977197819791980198119821983198419851986198719881989199019911992199319941995199619971998199920002001200220032004200520062007200820092010201120122013มกราคมกุมภาพันธ์มีนาคมเมษายนพฤษภาคมมิถุนายนกรกฎาคมสิงหาคมกันยายนตุลาคมพฤศจิกายนธันวาคม  อ.จ.อ.พ.พฤ.ศ.ส.311234567891011121314151617181920212223242526272829301234567891011Close

















ชาย








หญิง








ไม่ระบุ























 















ฉันได้อ่านและยอมรับ ข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัวของเดอะ พิซซ่า คอมปะนี















ฉันยินยอมรับข้อมูลข่าวสาร กิจกรรมส่งเสริมการขายต่างๆ จากเดอะ พิซซ่า คอมปะนีและบริษัทในเครือ โดยเราจะเก็บข้อมูลของท่านไว้เป็นความลับ สามารถศึกษาเงื่อนไข/ข้อตกลง นโยบายความเป็นส่วนตัวเพิ่มเติมได้ที่เว็บไซต์ของบริษัทฯ







สมัครสมาชิก
 กรุณารอสักครู่...


')]</value>
      <webElementGuid>ed1c4333-2283-483e-b8c5-dd7ad3c18d30</webElementGuid>
   </webElementXpaths>
</WebElementEntity>
